eliel-dev/mica-audio/firmware/esp32s3-devkitc1/src/main.cpp
#include <Arduino.h>
#include <ArduinoJson.h>
#include <HTTPClient.h>
#include <Preferences.h>
#include <PubSubClient.h>
#include <WebSocketsClient.h>
#include <WiFi.h>
#include <WiFiManager.h>
#include <esp_heap_caps.h>
#include <soc/soc_caps.h>
#include "firmware_version.h"

#if __has_include("firmware_version.auto.h")
#include "firmware_version.auto.h"
#endif

#ifndef MICA_FIRMWARE_VERSION
#define MICA_FIRMWARE_VERSION MICA_FIRMWARE_VERSION_FALLBACK
#endif

#if defined(MICA_PROFILE_DMA_EXP)
#include <ESP32-HUB75-MatrixPanel-I2S-DMA.h>
#endif

namespace {
// DOCS: docs/wiki/modules/firmware-esp32s3-devkitc1.md#fluxo-de-execucao
constexpr uint8_t kBinsCount = MICA_STREAM_BINS;
constexpr size_t kStreamFrameSize = 145;
constexpr size_t kStreamFrame128x64Rgb565Size = 16400;
constexpr uint8_t kStreamVersion = 2;
constexpr uint8_t kStreamBinsMessageType = 1;
constexpr uint8_t kStreamFrame128x64Rgb565MessageType = 2;
constexpr unsigned long kWifiDisconnectProvisioningFallbackMs = 20000;
constexpr unsigned long kMqttReconnectRetryMs = 5000;
constexpr unsigned long kWsReconnectRetryMs = 60000;
constexpr unsigned long kWsAutoReconnectIntervalMs = 2000;
constexpr unsigned long kWsFlapReportWindowMs = 60000;
constexpr uint8_t kWsFlapReportThreshold = 3;
constexpr unsigned long kTelemetryIntervalMs = 2000;
constexpr unsigned long kSerialHelloIntervalMs = 3000;
constexpr size_t kSerialInputMaxLength = 1024;
constexpr unsigned long kWifiConnectAttemptTimeoutMs = 20000;
constexpr uint16_t kDefaultMqttPort = 5273;
constexpr const char* kDefaultMqttRootTopic = "mica/v1/devices";
constexpr uint16_t kMqttPacketBufferBytes = 32768;
constexpr uint8_t kMatrixWidth = MICA_MATRIX_WIDTH;
constexpr uint8_t kMatrixHeight = MICA_MATRIX_HEIGHT;
constexpr uint8_t kMatrixHalfHeight = kMatrixHeight / 2;
constexpr size_t kMatrixPixelCount = static_cast<size_t>(kMatrixWidth) * static_cast<size_t>(kMatrixHeight);
static_assert((kMatrixHeight % 2) == 0, "MICA_MATRIX_HEIGHT must be even.");

constexpr const char* kBoardModel = "esp32s3_devkitc1";
constexpr const char* kBoardDisplayName = "ESP32-S3 DevKitC-1";
constexpr uint8_t kMatrixRgbPins[6] = {4, 5, 6, 7, 15, 16};
constexpr uint8_t kMatrixAddrPins[5] = {18, 8, 3, 42, 41};
constexpr uint8_t kMatrixClockPin = 41;
constexpr uint8_t kMatrixLatchPin = 40;
constexpr uint8_t kMatrixOePin = 2;
constexpr uint8_t kSerialRxPin = 44;
constexpr uint8_t kSerialTxPin = 43;

constexpr const char* kPanelType = "hub75_p2_5_128x64_smd2121_scan32";
#ifndef MICA_TEST_LED_GPIO
#define MICA_TEST_LED_GPIO -1
#endif
constexpr int kTestLedPin = MICA_TEST_LED_GPIO;
#if defined(RGB_BUILTIN)
constexpr int kOnboardTestLedPin = RGB_BUILTIN;
#elif defined(PIN_NEOPIXEL)
constexpr int kOnboardTestLedPin = PIN_NEOPIXEL;
#else
constexpr int kOnboardTestLedPin = -1;
#endif

constexpr unsigned long kTestLedDurationMs = 1500;
constexpr unsigned long kTestLedTogglePeriodMs = 120;
constexpr uint8_t kTestLedPwmChannel = 0;
constexpr uint16_t kTestLedPwmFrequencyHz = 5000;
constexpr uint8_t kTestLedPwmResolutionBits = 8;

constexpr const char* kFirmwareProfile = "dma_exp";
constexpr const char* kFirmwareVersion = MICA_FIRMWARE_VERSION;
constexpr uint8_t kBrightnessSafeMin = 30;
constexpr uint8_t kBrightnessSafeMax = 160;
constexpr uint8_t kBrightnessDefaultCap = 160;
constexpr const char* kWifiStateConnecting = "connecting";
constexpr const char* kWifiStateConnected = "connected";
constexpr const char* kWifiStatePortal = "portal";
constexpr const char* kWifiStateDisconnected = "disconnected";
constexpr const char* kSerialProvisioningProtocol = "mica.serial.v1";

#if defined(MICA_SECURITY_PROFILE_RELEASE)
constexpr const char* kSecurityProfile = "release";
#else
constexpr const char* kSecurityProfile = "dev";
#endif

Preferences gPrefs;
WebSocketsClient gWs;
WiFiClient gMqttNetClient;
PubSubClient gMqtt(gMqttNetClient);
String gServerHost;
uint16_t gServerPort = 5272;
String gMqttHost;
uint16_t gMqttPort = kDefaultMqttPort;
String gMqttRootTopic = kDefaultMqttRootTopic;
String gDeviceId;
String gToken;
String gActiveAppId;
String gActiveAppName;
String gActiveAppConfig;
uint8_t gBins[kBinsCount] = {0};
uint8_t gLevel = 0;
uint8_t gStreamBrightness = 255;
uint8_t gBrightnessCap = kBrightnessDefaultCap;
uint16_t gFrameRgb565[kMatrixPixelCount] = {0};
unsigned long gLastFrameMs = 0;
unsigned long gWsDisconnectedSinceMs = 0;
unsigned long gMqttDisconnectedSinceMs = 0;
unsigned long gWifiDisconnectedSinceMs = 0;
unsigned long gLastTelemetryMs = 0;
unsigned long gTestLedUntilMs = 0;
unsigned long gTestLedNextToggleMs = 0;
bool gTestLedState = false;
bool gTestLedEnabled = false;
bool gTestLedPwmReady = false;
bool gAuxLedAvailable = false;
bool gOnboardTestLedAvailable = false;
uint8_t gTestLedDuty = 0;
uint8_t gTestLedPulseDuty = 0;
bool gMatrixReady = false;
uint8_t gAppliedBrightness = 255;
bool gFrameModeActive = false;
uint64_t gLoopBusyTimeUs = 0;
unsigned long gLoopWindowStartMs = 0;
uint8_t gLoopLoadPercent = 0;
uint32_t gTelemetrySequence = 0;
bool gHasStreamLastSequence = false;
uint32_t gStreamLastSequence = 0;
uint32_t gStreamFramesReceived = 0;
uint32_t gStreamFramesApplied = 0;
uint32_t gStreamSequenceGapCount = 0;
uint32_t gStreamInvalidFrameCount = 0;
bool gProvisioningPortalActive = false;
String gWifiState = kWifiStateConnecting;
String gLastWifiEvent = "boot";
String gAuxLedUnavailableReason;
String gSerialInputBuffer;
unsigned long gLastSerialHelloMs = 0;
unsigned long gWsFlapWindowStartMs = 0;
uint16_t gWsConnectCountInWindow = 0;
uint16_t gWsDisconnectCountInWindow = 0;

void connectWebSocket();
void connectMqtt();
void handleControlCommandMessage(const JsonDocument& control);

#if defined(MICA_PROFILE_DMA_EXP)
MatrixPanel_I2S_DMA* gMatrix = nullptr;
#endif

struct RgbColor {
  uint8_t r;
  uint8_t g;
  uint8_t b;
};

RgbColor rainbowColorForColumn(uint16_t column, uint16_t columnCount) {
  if (columnCount <= 1) {
    return {255, 0, 0};
  }

  const uint8_t hue = static_cast<uint8_t>((column * 255u) / (columnCount - 1u));
  const uint8_t region = hue / 43u;
  const uint8_t remainder = static_cast<uint8_t>((hue - (region * 43u)) * 6u);
  const uint8_t q = static_cast<uint8_t>(255u - remainder);
  const uint8_t t = remainder;

  switch (region) {
    case 0:
      return {255, t, 0};
    case 1:
      return {q, 255, 0};
    case 2:
      return {0, 255, t};
    case 3:
      return {0, q, 255};
    case 4:
      return {t, 0, 255};
    default:
      return {255, 0, q};
  }
}

RgbColor rgb565ToRgb888(uint16_t rgb565) {
  const uint8_t r5 = static_cast<uint8_t>((rgb565 >> 11) & 0x1Fu);
  const uint8_t g6 = static_cast<uint8_t>((rgb565 >> 5) & 0x3Fu);
  const uint8_t b5 = static_cast<uint8_t>(rgb565 & 0x1Fu);

  const uint8_t r = static_cast<uint8_t>((static_cast<uint16_t>(r5) * 255u + 15u) / 31u);
  const uint8_t g = static_cast<uint8_t>((static_cast<uint16_t>(g6) * 255u + 31u) / 63u);
  const uint8_t b = static_cast<uint8_t>((static_cast<uint16_t>(b5) * 255u + 15u) / 31u);
  return {r, g, b};
}

bool isReservedHub75Pin(int pin) {
  for (uint8_t gpio : kMatrixRgbPins) {
    if (static_cast<int>(gpio) == pin) {
      return true;
    }
  }

  for (uint8_t gpio : kMatrixAddrPins) {
    if (static_cast<int>(gpio) == pin) {
      return true;
    }
  }

  return pin == static_cast<int>(kMatrixClockPin)
      || pin == static_cast<int>(kMatrixLatchPin)
      || pin == static_cast<int>(kMatrixOePin);
}

bool tryValidateAuxLedPin(int pin, String& reason) {
  if (pin < 0) {
    reason = "desabilitado por build flag";
    return false;
  }

  if (pin >= static_cast<int>(SOC_GPIO_PIN_COUNT)) {
    reason = "fora da faixa de GPIO fisico";
    return false;
  }

  if (isReservedHub75Pin(pin)) {
    reason = "conflito com pinos HUB75";
    return false;
  }

  if (pin == static_cast<int>(kSerialRxPin) || pin == static_cast<int>(kSerialTxPin)) {
    reason = "conflito com serial";
    return false;
  }

