eliel-dev/mica-audio/firmware/esp32s3-devkitc1/src/main.cpp
  return true;
}

void logConnectivityState(const char* eventOverride = nullptr) {
  const char* eventName = (eventOverride != nullptr && eventOverride[0] != '\0')
      ? eventOverride
      : gLastWifiEvent.c_str();

  Serial.printf("[conn] wifiState=%s portal=%s event=%s\n",
      gWifiState.c_str(),
      gProvisioningPortalActive ? "on" : "off",
      eventName);
}

void flushWsFlapDiagnostics(bool force = false) {
  if (gWsFlapWindowStartMs == 0) {
    return;
  }

  const unsigned long now = millis();
  const unsigned long elapsed = now - gWsFlapWindowStartMs;
  if (!force && elapsed < kWsFlapReportWindowMs) {
    return;
  }

  if (gWsDisconnectCountInWindow >= kWsFlapReportThreshold) {
    Serial.printf(
        "[ws_diag] window_ms=%lu connects=%u disconnects=%u reconnect_interval_ms=%lu state=flapping\n",
        elapsed,
        gWsConnectCountInWindow,
        gWsDisconnectCountInWindow,
        kWsAutoReconnectIntervalMs);
  }

  gWsFlapWindowStartMs = now;
  gWsConnectCountInWindow = 0;
  gWsDisconnectCountInWindow = 0;
}

void registerWsConnectivitySample(bool connected) {
  if (gWsFlapWindowStartMs == 0) {
    gWsFlapWindowStartMs = millis();
  } else {
    flushWsFlapDiagnostics(false);
  }

  if (connected) {
    gWsConnectCountInWindow++;
  } else {
    gWsDisconnectCountInWindow++;
  }
}

void setConnectivityState(const char* wifiState, const char* lastEvent, bool forceLog = false, bool publishEvent = true) {
  bool changed = false;
  if (wifiState != nullptr && wifiState[0] != '\0' && !gWifiState.equals(wifiState)) {
    gWifiState = wifiState;
    changed = true;
  }

  if (publishEvent && lastEvent != nullptr && lastEvent[0] != '\0' && !gLastWifiEvent.equals(lastEvent)) {
    gLastWifiEvent = lastEvent;
    changed = true;
  }

  if (changed || forceLog) {
    logConnectivityState(publishEvent ? nullptr : lastEvent);
  }
}

void setProvisioningPortalActive(bool active, const char* eventName) {
  if (gProvisioningPortalActive == active && (eventName == nullptr || eventName[0] == '\0')) {
    return;
  }

  gProvisioningPortalActive = active;
  setConnectivityState(active ? kWifiStatePortal : kWifiStateConnected, eventName, true);
}

void initializeOnboardTestLed() {
  gOnboardTestLedAvailable = false;

#if defined(RGB_BUILTIN) || defined(PIN_NEOPIXEL)
  if (kOnboardTestLedPin >= 0) {
    gOnboardTestLedAvailable = true;
    neopixelWrite(kOnboardTestLedPin, 0, 0, 0);
    Serial.printf("[led] LED onboard habilitado no pino %d.\n", kOnboardTestLedPin);
    return;
  }
#endif

  Serial.println("[led] LED onboard indisponivel neste build.");
}

void initializeAuxLed() {
  gAuxLedAvailable = false;
  gTestLedPwmReady = false;
  gTestLedDuty = 0;
  gAuxLedUnavailableReason = "";

  String validationReason;
  if (!tryValidateAuxLedPin(kTestLedPin, validationReason)) {
    gAuxLedUnavailableReason = validationReason;
    gTestLedEnabled = false;
    gPrefs.putBool("testLedEnabled", false);
    Serial.printf("[led] LED auxiliar indisponivel (GPIO %d): %s\n", kTestLedPin, gAuxLedUnavailableReason.c_str());
    return;
  }

  if (ledcSetup(kTestLedPwmChannel, kTestLedPwmFrequencyHz, kTestLedPwmResolutionBits) <= 0) {
    gAuxLedUnavailableReason = "falha no ledcSetup";
    gTestLedEnabled = false;
    gPrefs.putBool("testLedEnabled", false);
    Serial.printf("[led] Falha ao inicializar PWM do LED auxiliar (GPIO %d).\n", kTestLedPin);
    return;
  }

  pinMode(kTestLedPin, OUTPUT);
  ledcAttachPin(kTestLedPin, kTestLedPwmChannel);
  gTestLedPwmReady = true;
  gAuxLedAvailable = true;
  Serial.printf("[led] LED auxiliar habilitado no GPIO %d.\n", kTestLedPin);
}

bool isTestLedAvailable() {
  return gOnboardTestLedAvailable || gAuxLedAvailable;
}

uint8_t clampBrightnessToSafeRange(int value) {
  if (value < static_cast<int>(kBrightnessSafeMin)) {
    return kBrightnessSafeMin;
  }

  if (value > static_cast<int>(kBrightnessSafeMax)) {
    return kBrightnessSafeMax;
  }

  return static_cast<uint8_t>(value);
}

uint8_t resolveRequestedBrightness() {
  return clampBrightnessToSafeRange(static_cast<int>(gStreamBrightness));
}

uint8_t resolveAppliedBrightness() {
  const uint8_t requested = resolveRequestedBrightness();
  return (requested < gBrightnessCap) ? requested : gBrightnessCap;
}

void applyAuxTestLedDuty(uint8_t duty) {
  if (!gAuxLedAvailable || !gTestLedPwmReady) {
    return;
  }

  ledcWrite(kTestLedPwmChannel, duty);
}

void applyOnboardTestLedDuty(uint8_t duty) {
  if (!gOnboardTestLedAvailable) {
    return;
  }

#if defined(RGB_BUILTIN) || defined(PIN_NEOPIXEL)
  neopixelWrite(kOnboardTestLedPin, duty, duty, duty);
#else
  (void)duty;
#endif
}

void applyTestLedDutyToOutputs(uint8_t duty) {
  applyAuxTestLedDuty(duty);
  applyOnboardTestLedDuty(duty);
}

void applyTestLedState() {
  if (!isTestLedAvailable()) {
    return;
  }

  if (gTestLedUntilMs > 0) {
    applyTestLedDutyToOutputs(gTestLedState ? gTestLedPulseDuty : 0);
    return;
  }

  if (gAuxLedAvailable && gTestLedEnabled) {
    applyAuxTestLedDuty(gTestLedDuty);
  } else {
    applyAuxTestLedDuty(0);
  }

  applyOnboardTestLedDuty(0);
}

void updateTestLedDutyFromBrightness(uint8_t brightness) {
  if (!gAuxLedAvailable) {
    gTestLedDuty = 0;
  } else if (gTestLedDuty != brightness) {
    gTestLedDuty = brightness;
  }

  gTestLedPulseDuty = brightness;
  if (gTestLedUntilMs == 0) {
    applyTestLedState();
  }
}

void setMatrixBrightness(uint8_t brightness) {
  if (gAppliedBrightness == brightness) {
    return;
  }

#if defined(MICA_PROFILE_DMA_EXP)
  if (gMatrixReady && gMatrix != nullptr) {
    gMatrix->setBrightness8(brightness);
  }
#endif

  gAppliedBrightness = brightness;
}

void clearMatrix() {
  if (!gMatrixReady) {
    return;
  }

#if defined(MICA_PROFILE_DMA_EXP)
  if (gMatrix != nullptr) {
    gMatrix->clearScreen();
  }
#endif
}

void drawMatrixPixel(uint8_t x, uint8_t y, const RgbColor& color) {

#if defined(MICA_PROFILE_DMA_EXP)
  if (gMatrix != nullptr) {
    gMatrix->drawPixelRGB888(x, y, color.r, color.g, color.b);
  }
#endif
}

