eliel-dev/mica-audio/firmware/esp32s3-devkitc1/src/main.cpp
void commitMatrixFrame() {
}

// DOCS: docs/wiki/modules/firmware-esp32s3-devkitc1.md#pontos-de-alteracao-frequente
bool initMatrixDisplay() {

#if defined(MICA_PROFILE_DMA_EXP)
  HUB75_I2S_CFG::i2s_pins pinMap = {
      static_cast<int8_t>(kMatrixRgbPins[0]),
      static_cast<int8_t>(kMatrixRgbPins[1]),
      static_cast<int8_t>(kMatrixRgbPins[2]),
      static_cast<int8_t>(kMatrixRgbPins[3]),
      static_cast<int8_t>(kMatrixRgbPins[4]),
      static_cast<int8_t>(kMatrixRgbPins[5]),
      static_cast<int8_t>(kMatrixAddrPins[0]),
      static_cast<int8_t>(kMatrixAddrPins[1]),
      static_cast<int8_t>(kMatrixAddrPins[2]),
      static_cast<int8_t>(kMatrixAddrPins[3]),
      static_cast<int8_t>(-1),
      static_cast<int8_t>(kMatrixLatchPin),
      static_cast<int8_t>(kMatrixOePin),
      static_cast<int8_t>(kMatrixClockPin)};

  HUB75_I2S_CFG config(kMatrixWidth, kMatrixHeight, 1, pinMap);
  config.i2sspeed = HUB75_I2S_CFG::HZ_10M;
  config.clkphase = false;

  gMatrix = new MatrixPanel_I2S_DMA(config);
  if (gMatrix == nullptr) {
    Serial.println("Falha ao alocar MatrixPanel_I2S_DMA.");
    return false;
  }

  if (!gMatrix->begin()) {
    Serial.println("Falha ao inicializar MatrixPanel_I2S_DMA.");
    delete gMatrix;
    gMatrix = nullptr;
    return false;
  }
#endif

  gMatrixReady = true;
  gAppliedBrightness = 0;
  setMatrixBrightness(resolveAppliedBrightness());
  updateTestLedDutyFromBrightness(gAppliedBrightness);
  clearMatrix();
  commitMatrixFrame();
  return true;
}

bool postJsonWithAuth(const String& path, JsonDocument& doc) {
  if (gDeviceId.isEmpty() || gToken.isEmpty() || gServerHost.isEmpty()) {
    return false;
  }

  HTTPClient http;
  String url = "http://" + gServerHost + ":" + String(gServerPort) + path;
  if (!http.begin(url)) {
    return false;
  }

  http.addHeader("Content-Type", "application/json");
  http.addHeader("X-Device-Id", gDeviceId);
  http.addHeader("X-Device-Token", gToken);

  String body;
  serializeJson(doc, body);
  int code = http.POST(body);
  http.end();

  return code >= 200 && code < 300;
}

void normalizeMqttConfig() {
  if (gMqttHost.isEmpty()) {
    gMqttHost = gServerHost;
  }

  if (gMqttPort == 0) {
    gMqttPort = kDefaultMqttPort;
  }

  if (gMqttRootTopic.isEmpty()) {
    gMqttRootTopic = kDefaultMqttRootTopic;
  }
}

void persistMqttConfig() {
  normalizeMqttConfig();
  gPrefs.putString("mqttHost", gMqttHost);
  gPrefs.putString("mqttPort", String(gMqttPort));
  gPrefs.putString("mqttRootTopic", gMqttRootTopic);
}

String buildDeviceMqttTopic(const char* suffix) {
  normalizeMqttConfig();
  return gMqttRootTopic + "/" + gDeviceId + "/" + String(suffix == nullptr ? "" : suffix);
}

bool publishMqttDocument(const String& topic, JsonDocument& doc, bool retained) {
  if (!gMqtt.connected()) {
    return false;
  }

  String payload;
  serializeJson(doc, payload);
  return gMqtt.publish(topic.c_str(), payload.c_str(), retained);
}

String buildPresencePayload(const char* state) {
  JsonDocument presence;
  presence["deviceId"] = gDeviceId;
  presence["state"] = state == nullptr ? "offline" : state;

  String payload;
  serializeJson(presence, payload);
  return payload;
}

bool publishPresence(const char* state) {
  if (gDeviceId.isEmpty() || !gMqtt.connected()) {
    return false;
  }

  JsonDocument presence;
  presence["deviceId"] = gDeviceId;
  presence["state"] = state == nullptr ? "offline" : state;
  return publishMqttDocument(buildDeviceMqttTopic("presence"), presence, true);
}

void disconnectMqtt(bool publishOffline) {
  if (!gMqtt.connected()) {
    return;
  }

  if (publishOffline) {
    (void)publishPresence("offline");
    delay(20);
  }

  gMqtt.disconnect();
  gLastTelemetryMs = 0;
  gMqttDisconnectedSinceMs = millis();
}

void sendCommandProgress(
    const String& commandId,
    uint8_t progressPercent,
    const char* stage,
    const String& message,
    int successFlag = -1) {
  if (commandId.isEmpty() || !gMqtt.connected()) {
    return;
  }

  JsonDocument progress;
  progress["deviceId"] = gDeviceId;
  progress["commandId"] = commandId;
  progress["progressPercent"] = progressPercent;
  if (stage != nullptr && stage[0] != '\0') {
    progress["stage"] = stage;
  }
  if (message.length() > 0) {
    progress["message"] = message;
  }
  if (successFlag == 0 || successFlag == 1) {
    progress["success"] = successFlag == 1;
  }

  (void)publishMqttDocument(buildDeviceMqttTopic("command-events"), progress, false);
}

void postCommandAck(
    const String& commandId,
    bool success,
    const String& message,
    int progressPercent,
    const char* stage,
    const char* errorCode = nullptr) {
  if (commandId.isEmpty()) {
    return;
  }

  JsonDocument ack;
  ack["deviceId"] = gDeviceId;
  ack["commandId"] = commandId;
  ack["success"] = success;
  ack["message"] = message;
  ack["progressPercent"] = progressPercent;
  if (stage != nullptr && stage[0] != '\0') {
    ack["stage"] = stage;
  }
  if (errorCode != nullptr && errorCode[0] != '\0') {
    ack["errorCode"] = errorCode;
  }

  postJsonWithAuth("/api/v1/device/command-ack", ack);
}

bool trySanitizeLargestFreeBlock(uint32_t freeBytes, size_t largestRawBytes, uint32_t& largestSanitizedBytes) {
  if (freeBytes == 0 || largestRawBytes == 0) {
    return false;
  }

  size_t normalizedLargest = largestRawBytes;
  if (normalizedLargest > freeBytes) {
    normalizedLargest = freeBytes;
  }

  if (normalizedLargest == 0) {
    return false;
  }

  largestSanitizedBytes = static_cast<uint32_t>(normalizedLargest);
  return true;
}

void updateLoopLoadPercent(uint32_t loopStartUs) {
  const uint32_t nowUs = micros();
  const uint32_t elapsedUs = nowUs - loopStartUs;
  gLoopBusyTimeUs += static_cast<uint64_t>(elapsedUs);

  const unsigned long nowMs = millis();
  if (gLoopWindowStartMs == 0) {
    gLoopWindowStartMs = nowMs;
    return;
  }

  const unsigned long windowElapsedMs = nowMs - gLoopWindowStartMs;
  if (windowElapsedMs < 1000) {
    return;
  }

  const uint64_t windowElapsedUs = static_cast<uint64_t>(windowElapsedMs) * 1000ULL;
  uint64_t loadPercent = 0;
  if (windowElapsedUs > 0) {
    loadPercent = (gLoopBusyTimeUs * 100ULL) / windowElapsedUs;
  }

  if (loadPercent > 100ULL) {
    loadPercent = 100ULL;
  }

  gLoopLoadPercent = static_cast<uint8_t>(loadPercent);
  gLoopBusyTimeUs = 0;
  gLoopWindowStartMs = nowMs;
}

