eliel-dev/mica-audio/firmware/esp32s3-devkitc1/src/main.cpp
void handleSerialProvisioningLine(const String& line) {
  JsonDocument command;
  if (deserializeJson(command, line) != DeserializationError::Ok) {
    return;
  }

  String type = command["type"] | "";
  if (!type.equalsIgnoreCase("provision")) {
    return;
  }

  String requestId = command["requestId"] | "";
  String ssid = command["ssid"] | "";
  String password = command["password"] | "";
  String serverBaseUrl = command["serverBaseUrl"] | "";
  String pairCode = command["pairCode"] | "";

  if (requestId.length() == 0) {
    return;
  }

  if (ssid.length() == 0) {
    sendSerialResult(requestId, false, "SSID ausente no request de provisionamento.", "ssid_required");
    return;
  }

  String parsedHost;
  uint16_t parsedPort = 0;
  if (!tryParseServerBaseUrl(serverBaseUrl, parsedHost, parsedPort)) {
    sendSerialResult(requestId, false, "serverBaseUrl invalido.", "server_base_url_invalid");
    return;
  }

  sendSerialProgress(requestId, "wifi_connecting", "Conectando ao Wi-Fi.");
  if (!connectWifiWithTimeout(ssid, password, kWifiConnectAttemptTimeoutMs)) {
    sendSerialResult(requestId, false, "Falha ao conectar no Wi-Fi.", "wifi_connect_failed");
    return;
  }

  gServerHost = parsedHost;
  gServerPort = parsedPort;
  gPrefs.putString("host", gServerHost);
  gPrefs.putString("port", String(gServerPort));
  gMqttHost = gServerHost;
  gMqttPort = kDefaultMqttPort;
  gMqttRootTopic = kDefaultMqttRootTopic;
  persistMqttConfig();
  sendSerialProgress(requestId, "wifi_connected", "Wi-Fi conectado.");

  String deviceName = gPrefs.getString("name", kBoardDisplayName);
  String pairErrorCode;
  String pairErrorMessage;
  sendSerialProgress(requestId, "pairing", "Executando pareamento com o servidor.");
  if (!pairWithServer(pairCode, deviceName, pairErrorCode, pairErrorMessage)) {
    sendSerialResult(requestId, false, pairErrorMessage, pairErrorCode.c_str());
    return;
  }

  connectMqtt();
  connectWebSocket();
  sendTelemetry(true);
  sendSerialProgress(requestId, "done", "Provisionamento concluido.");
  sendSerialResult(requestId, true, "Provisionamento concluido com sucesso.");
}

void processSerialProvisioning() {
  const unsigned long now = millis();
  if (gLastSerialHelloMs == 0 || (now - gLastSerialHelloMs) >= kSerialHelloIntervalMs) {
    sendSerialHello();
    gLastSerialHelloMs = now;
  }

  while (Serial.available() > 0) {
    char character = static_cast<char>(Serial.read());
    if (character == '\r') {
      continue;
    }

    if (character == '\n') {
      String line = gSerialInputBuffer;
      gSerialInputBuffer = "";
      line.trim();
      if (line.length() > 0) {
        handleSerialProvisioningLine(line);
      }

      continue;
    }

    if (gSerialInputBuffer.length() < kSerialInputMaxLength) {
      gSerialInputBuffer += character;
    }
  }
}

// DOCS: docs/wiki/guides/setup-new-device.md#passos
bool startProvisioningPortal(const char* reason) {
  disconnectMqtt(true);
  gWs.disconnect();
  gLastTelemetryMs = 0;
  setProvisioningPortalActive(true, reason);
  Serial.printf("[portal_open] motivo=%s\n", reason == nullptr ? "-" : reason);

  WiFiManager wm;
  wm.setConfigPortalBlocking(true);
  wm.setConfigPortalTimeout(0);

  String savedHost = gPrefs.getString("host", "");
  uint16_t savedPort = static_cast<uint16_t>(atoi(gPrefs.getString("port", "5272").c_str()));
  String savedServerBaseUrl = buildServerBaseUrl(savedHost, savedPort);

  WiFiManagerParameter pServer("server", "Servidor", savedServerBaseUrl.c_str(), 96);
  WiFiManagerParameter pPair("pair", "Codigo pareamento", "", 12);
  WiFiManagerParameter pName("name", "Nome dispositivo", gPrefs.getString("name", kBoardDisplayName).c_str(), 32);

  wm.addParameter(&pServer);
  wm.addParameter(&pPair);
  wm.addParameter(&pName);

  String apName = "MicaAudio-Setup-" + String((uint32_t)ESP.getEfuseMac(), HEX).substring(6);
  Serial.printf("[provisioning] AP=%s reason=%s\n", apName.c_str(), reason == nullptr ? "-" : reason);
  if (!wm.autoConnect(apName.c_str())) {
    setConnectivityState(kWifiStatePortal, "portal_error", true);
    Serial.println("[provisioning] autoConnect retornou false; portal permanece disponivel.");
    return false;
  }

  setProvisioningPortalActive(false, "wifi_connected");
  Serial.println("[portal_close] provisioning encerrado apos conexao Wi-Fi.");
  gWifiDisconnectedSinceMs = 0;
  setConnectivityState(kWifiStateConnected, "wifi_connected", true);

  gPrefs.putString("name", pName.getValue());

  String serverConfigErrorCode;
  String serverConfigErrorMessage;
  if (!tryApplyProvisioningPortalServer(pServer.getValue(), savedHost, savedPort, serverConfigErrorCode, serverConfigErrorMessage)) {
    Serial.printf("[provisioning] falha ao aplicar Servidor do portal: %s (%s)\n",
        serverConfigErrorMessage.c_str(),
        serverConfigErrorCode.c_str());
    return false;
  }

  String pairingCode = pPair.getValue();
  String pairErrorCode;
  String pairErrorMessage;
  if (!pairWithServer(pairingCode, pName.getValue(), pairErrorCode, pairErrorMessage)) {
    Serial.printf("[pair] falha no provisioning portal: %s (%s)\n", pairErrorMessage.c_str(), pairErrorCode.c_str());
  }

  return true;
}

void enterProvisioningMode(bool clearDeviceCredentials, const char* reason) {
  if (clearDeviceCredentials) {
    gPrefs.remove("deviceId");
    gPrefs.remove("token");
    gDeviceId = "";
    gToken = "";
  }

  (void)startProvisioningPortal(reason);
}

void handleControlCommandMessage(const JsonDocument& control) {
  const char *command = control["command"] | "";
  String commandId = control["commandId"] | "";
  JsonObjectConst parameters = control["parameters"].as<JsonObjectConst>();

  if (strcmp(command, "enter_provisioning") == 0) {
    sendCommandProgress(commandId, 20, "received", "Comando recebido.");
    sendCommandProgress(commandId, 100, "enter-provisioning", "Entrando em provisioning.", 1);
    enterProvisioningMode(true, "command_enter_provisioning");
    return;
  }

  if (strcmp(command, "revoke_and_restart") == 0) {
    sendCommandProgress(commandId, 20, "received", "Comando recebido.");
    sendCommandProgress(commandId, 100, "revoke-restart", "Reiniciando dispositivo.", 1);
    (void)publishPresence("offline");
    delay(50);
    gPrefs.remove("deviceId");
    gPrefs.remove("token");
    delay(200);
    ESP.restart();
    return;
  }

  if (strcmp(command, "test_led") == 0) {
    sendCommandProgress(commandId, 20, "received", "Comando recebido.");

    JsonVariantConst enabledValue = parameters["enabled"];
    if (!enabledValue.isNull()) {
      bool enabled = false;
      if (!tryParseBooleanParameter(enabledValue, enabled)) {
        sendCommandProgress(commandId, 100, "invalid", "Parametro enabled invalido.", 0);
        return;
      }

      Serial.printf("[led] parametro legado enabled recebido: %s\n", enabled ? "true" : "false");
      if (gAuxLedAvailable) {
        gTestLedEnabled = enabled;
        gPrefs.putBool("testLedEnabled", gTestLedEnabled);
      } else {
        gTestLedEnabled = false;
        gPrefs.putBool("testLedEnabled", false);
      }

      updateTestLedDutyFromBrightness(resolveAppliedBrightness());
      clearTestLed();
      applyTestLedState();
      sendTelemetry(true);
      const char* message = gAuxLedAvailable
          ? (gTestLedEnabled ? "Compat legado: LED auxiliar habilitado." : "Compat legado: LED auxiliar desabilitado.")
          : "Compat legado: sem LED auxiliar, parametro enabled ignorado.";
      sendCommandProgress(commandId, 100, "set-test-led-compat", message, 1);
      return;
    }

    if (!isTestLedAvailable()) {
      sendCommandProgress(commandId, 100, "test-led-unavailable", "Nenhum LED de teste disponivel neste hardware.", 0);
      return;
    }

    triggerTestLed();
    sendCommandProgress(commandId, 100, "test-led", "Teste de LED acionado.", 1);
    return;
  }

  if (strcmp(command, "set_brightness") == 0) {
    String brightnessRaw = parameters["brightness"] | "";

    sendCommandProgress(commandId, 20, "received", "Comando recebido.");
    if (brightnessRaw.length() == 0) {
      sendCommandProgress(commandId, 100, "invalid", "brightness ausente.", 0);
      return;
    }

    const int brightnessValue = brightnessRaw.toInt();
    if (brightnessValue == 0 && brightnessRaw != "0") {
      sendCommandProgress(commandId, 100, "invalid", "brightness invalido.", 0);
      return;
    }

    gBrightnessCap = clampBrightnessToSafeRange(brightnessValue);
    gPrefs.putUChar("brightnessCap", gBrightnessCap);
    setMatrixBrightness(resolveAppliedBrightness());
    updateTestLedDutyFromBrightness(gAppliedBrightness);
    applyTestLedState();
    sendTelemetry(true);

