eliel-dev/mica-audio/firmware/esp32s3-devkitc1/src/main.cpp
void connectWebSocket() {
  if (gDeviceId.isEmpty() || gToken.isEmpty() || gServerHost.isEmpty()) {
    setConnectivityState(kWifiStateConnecting, "ws_missing_auth", true, false);
    return;
  }

  if (WiFi.status() != WL_CONNECTED) {
    setConnectivityState(kWifiStateConnecting, "ws_waiting_wifi", true, false);
    return;
  }

  String extraHeaders = "X-Device-Id: " + gDeviceId + "\r\nX-Device-Token: " + gToken;
  gWs.setExtraHeaders(extraHeaders.c_str());
  String path = "/ws/v1/stream";
  Serial.printf("[ws] conectando em ws://%s:%u%s\n", gServerHost.c_str(), gServerPort, path.c_str());
  setConnectivityState(kWifiStateConnected, "ws_connecting", true, false);
  gWs.begin(gServerHost.c_str(), gServerPort, path.c_str());
  gWs.onEvent(onWsEvent);
  gWs.setReconnectInterval(kWsAutoReconnectIntervalMs);
}

void connectMqtt() {
  normalizeMqttConfig();
  if (gDeviceId.isEmpty() || gToken.isEmpty() || gMqttHost.isEmpty()) {
    return;
  }

  if (WiFi.status() != WL_CONNECTED) {
    return;
  }

  if (gMqtt.connected()) {
    return;
  }

  gMqtt.setServer(gMqttHost.c_str(), gMqttPort);
  gMqtt.setCallback(onMqttMessage);
  gMqtt.setBufferSize(kMqttPacketBufferBytes);

  String presenceTopic = buildDeviceMqttTopic("presence");
  String offlinePayload = buildPresencePayload("offline");
  Serial.printf("[mqtt] conectando em mqtt://%s:%u (%s)\n", gMqttHost.c_str(), gMqttPort, gMqttRootTopic.c_str());

  const bool connected = gMqtt.connect(
      gDeviceId.c_str(),
      gDeviceId.c_str(),
      gToken.c_str(),
      presenceTopic.c_str(),
      1,
      true,
      offlinePayload.c_str());

  if (!connected) {
    gMqttDisconnectedSinceMs = millis();
    return;
  }

  gMqttDisconnectedSinceMs = 0;
  (void)gMqtt.subscribe(buildDeviceMqttTopic("commands").c_str(), 1);
  (void)publishPresence("online");
  sendTelemetry(true);
}

// DOCS: docs/wiki/modules/firmware-esp32s3-devkitc1.md#fluxo-de-execucao
void drawBars() {
  if (!gMatrixReady) {
    return;
  }

  setMatrixBrightness(resolveAppliedBrightness());
  updateTestLedDutyFromBrightness(gAppliedBrightness);
  clearMatrix();

  const uint16_t columnCount = (kBinsCount < kMatrixWidth) ? kBinsCount : kMatrixWidth;
  for (uint16_t x = 0; x < columnCount; x++) {
    const uint16_t binIndex = (x * kBinsCount) / columnCount;
    const uint8_t amplitude = gBins[binIndex];
    const uint8_t barHeight =
        static_cast<uint8_t>((static_cast<uint16_t>(amplitude) * kMatrixHalfHeight + 254u) / 255u);

    if (barHeight == 0) {
      continue;
    }

    const RgbColor color = rainbowColorForColumn(x, columnCount);
    for (uint8_t offset = 0; offset < barHeight; offset++) {
      const uint8_t topY = static_cast<uint8_t>((kMatrixHalfHeight - 1u) - offset);
      const uint8_t bottomY = static_cast<uint8_t>(kMatrixHalfHeight + offset);
      drawMatrixPixel(static_cast<uint8_t>(x), topY, color);

      if (bottomY < kMatrixHeight) {
        drawMatrixPixel(static_cast<uint8_t>(x), bottomY, color);
      }
    }
  }

  commitMatrixFrame();
}

void drawFrame128x64() {
  if (!gMatrixReady) {
    return;
  }

  setMatrixBrightness(resolveAppliedBrightness());
  updateTestLedDutyFromBrightness(gAppliedBrightness);
  clearMatrix();

  for (uint8_t y = 0; y < kMatrixHeight; y++) {
    for (uint8_t x = 0; x < kMatrixWidth; x++) {
      const size_t index = static_cast<size_t>(y) * static_cast<size_t>(kMatrixWidth) + static_cast<size_t>(x);
      const RgbColor color = rgb565ToRgb888(gFrameRgb565[index]);
      drawMatrixPixel(x, y, color);
    }
  }

  commitMatrixFrame();
}
}  // namespace

void setup() {
  Serial.begin(115200);
  Serial.println("[boot] inicializando firmware.");
  if (strcmp(kSecurityProfile, "dev") == 0) {
    Serial.printf("MicaAudio firmware board=%s profile=%s security=%s\\n", kBoardModel, kFirmwareProfile, kSecurityProfile);
  }

  gPrefs.begin("micaaudio", false);
  Serial.println("[wifi_connecting] preparando conectividade.");
  setConnectivityState(kWifiStateConnecting, "boot", true);

  gBrightnessCap = clampBrightnessToSafeRange(static_cast<int>(gPrefs.getUChar("brightnessCap", kBrightnessDefaultCap)));
  gTestLedEnabled = gPrefs.getBool("testLedEnabled", false);
  gStreamBrightness = gBrightnessCap;
  gAppliedBrightness = resolveAppliedBrightness();
  initializeOnboardTestLed();
  initializeAuxLed();

  if (!initMatrixDisplay()) {
    Serial.println("Painel HUB75 indisponivel: exibicao de barras desativada.");
  }

  updateTestLedDutyFromBrightness(resolveAppliedBrightness());
  applyTestLedState();

  gServerHost = gPrefs.getString("host", "");
  gServerPort = static_cast<uint16_t>(atoi(gPrefs.getString("port", "5272").c_str()));
  gMqttHost = gPrefs.getString("mqttHost", "");
  gMqttPort = static_cast<uint16_t>(atoi(gPrefs.getString("mqttPort", "5273").c_str()));
  gMqttRootTopic = gPrefs.getString("mqttRootTopic", kDefaultMqttRootTopic);
  normalizeMqttConfig();
  gDeviceId = gPrefs.getString("deviceId", "");
  gToken = gPrefs.getString("token", "");
  gActiveAppId = gPrefs.getString("activeAppId", "");
  gActiveAppName = gPrefs.getString("activeAppName", "");
  gActiveAppConfig = gPrefs.getString("activeAppConfig", "");

  const bool missingServerConfig = gServerHost.isEmpty() || gServerPort == 0;
  const bool missingDeviceCredentials = gDeviceId.isEmpty() || gToken.isEmpty();
  if (missingServerConfig || missingDeviceCredentials) {
    const char* bootReason = missingServerConfig
        ? "boot_missing_server_config"
        : "boot_missing_device_credentials";
    Serial.printf("[boot] configuracao incompleta; abrindo provisioning portal (%s).\n", bootReason);
    (void)startProvisioningPortal(bootReason);

    gServerHost = gPrefs.getString("host", "");
    gServerPort = static_cast<uint16_t>(atoi(gPrefs.getString("port", "5272").c_str()));
    gMqttHost = gPrefs.getString("mqttHost", "");
    gMqttPort = static_cast<uint16_t>(atoi(gPrefs.getString("mqttPort", "5273").c_str()));
    gMqttRootTopic = gPrefs.getString("mqttRootTopic", kDefaultMqttRootTopic);
    normalizeMqttConfig();
    gDeviceId = gPrefs.getString("deviceId", "");
    gToken = gPrefs.getString("token", "");
  }

  WiFi.mode(WIFI_STA);
  WiFi.begin();

  bool bootWifiConnected = false;
  if (!gServerHost.isEmpty() && gServerPort != 0) {
    unsigned long bootWifiWaitStart = millis();
    while (WiFi.status() != WL_CONNECTED && (millis() - bootWifiWaitStart) < 5000) {
      processSerialProvisioning();
      delay(120);
    }

    bootWifiConnected = WiFi.status() == WL_CONNECTED;
  }

  if (gServerHost.isEmpty() || gServerPort == 0 || gDeviceId.isEmpty() || gToken.isEmpty()) {
    Serial.println("[wifi_connecting] aguardando provisioning por AP para concluir configuracao.");
    setConnectivityState(kWifiStateDisconnected, "boot_missing_server_config", true);
    gWifiDisconnectedSinceMs = millis();
  } else if (bootWifiConnected) {
    Serial.println("[wifi_connected] Wi-Fi conectado no boot.");
    setConnectivityState(kWifiStateConnected, "wifi_connected", true);
    connectMqtt();
    connectWebSocket();
  } else {
    Serial.println("[wifi_connecting] sem Wi-Fi no boot, aguardando reconexao.");
    setConnectivityState(kWifiStateDisconnected, "boot_waiting_wifi", true);
    gWifiDisconnectedSinceMs = millis();
  }

  sendSerialHello();
}

void loop() {
  const uint32_t loopStartUs = micros();
  processSerialProvisioning();
  const bool wifiConnected = WiFi.status() == WL_CONNECTED;

  if (!wifiConnected) {
    if (gWifiDisconnectedSinceMs == 0) {
      gWifiDisconnectedSinceMs = millis();
      setConnectivityState(kWifiStateDisconnected, "wifi_disconnected", true);
      Serial.println("[wifi] desconectado, aguardando reconexao.");
    }

    if (!gProvisioningPortalActive
        && (millis() - gWifiDisconnectedSinceMs) > kWifiDisconnectProvisioningFallbackMs) {
      Serial.println("[wifi] fallback para provisioning apos queda prolongada.");
      (void)startProvisioningPortal("wifi_disconnected_fallback");
      gWifiDisconnectedSinceMs = 0;
      connectMqtt();
      connectWebSocket();
    } else {
      delay(120);
    }

