eliel-dev/mica-audio/firmware/esp32s3-devkitc1/src/main.cpp
    processSerialProvisioning();
    updateTestLed();
    updateLoopLoadPercent(loopStartUs);
    return;
  }

  if (gWifiDisconnectedSinceMs != 0) {
    gWifiDisconnectedSinceMs = 0;
  }

  if (gProvisioningPortalActive) {
    setProvisioningPortalActive(false, "portal_closed");
  }

  setConnectivityState(kWifiStateConnected, "wifi_connected");
  gMqtt.loop();
  gWs.loop();
  flushWsFlapDiagnostics(false);

  if (!gMqtt.connected()) {
    if (gMqttDisconnectedSinceMs == 0) {
      gMqttDisconnectedSinceMs = millis();
    }

    if (millis() - gMqttDisconnectedSinceMs >= kMqttReconnectRetryMs) {
      connectMqtt();
      gMqttDisconnectedSinceMs = millis();
    }
  } else {
    gMqttDisconnectedSinceMs = 0;
    sendTelemetry(false);
  }

  if (!gWs.isConnected()) {
    if (gWsDisconnectedSinceMs == 0) {
      gWsDisconnectedSinceMs = millis();
      setConnectivityState(kWifiStateConnected, "ws_disconnected", false, false);
    }

    if (millis() - gWsDisconnectedSinceMs > kWsReconnectRetryMs) {
      Serial.println("[ws_disconnected] sem sessao por tempo prolongado; tentando reconectar websocket.");
      connectWebSocket();
      gWsDisconnectedSinceMs = millis();
    }
  } else {
    gWsDisconnectedSinceMs = 0;
  }

  if (millis() - gLastFrameMs > 15000) {
    memset(gBins, 0, sizeof(gBins));
    gLevel = 0;
    memset(gFrameRgb565, 0, sizeof(gFrameRgb565));
    gFrameModeActive = false;
  }

  updateTestLed();
  processSerialProvisioning();
  if (gFrameModeActive) {
    drawFrame128x64();
  } else {
    drawBars();
  }

  updateLoopLoadPercent(loopStartUs);
}
